jssmile/SmartScooter_stm32/main.c
      /* Write data to distance array */
      degree_distance[count*4] = distance_angle1;
      degree_distance[count*4 + 1] = distance_angle2;
      degree_distance[count*4 + 2] = distance_angle3;
      degree_distance[count*4 + 3] = distance_angle4;
    }
    vTaskDelay(30);
  }
}

/**
  * @brief  Use this task to detect the front obstacle
  * @param  None
  * @retval None
  */
static void Front_Obstacle_task(void *pvParameters){
  int count, i;
  int tmp_degree;
  int16_t x_position;
  int valid_distance[9] = {0};
  long tmp_1 = 0, tmp_2 = 0, tmp_3 = 0, tmp_4 = 0, tmp_5 = 0, tmp_6 = 0, tmp_7 = 0, tmp_8 = 0, tmp_9 = 0;
  int ratio = 19;
  long d_1 = ratio, d_2 = ratio, d_3 = ratio, d_4 = ratio, d_5 = ratio, d_6 = ratio, d_7 = ratio, d_8 = ratio, d_9 = ratio;
  int tmp_count = 0;
  char current_status ='F'; /* F : safe */

  while(1){
        tmp_1 = 0, tmp_2 = 0, tmp_3 = 0, tmp_4 = 0, tmp_5 = 0, tmp_6 = 0, tmp_7 = 0, tmp_8 = 0, tmp_9 = 0;
        ratio = 19;
        d_1 = ratio, d_2 = ratio, d_3 = ratio, d_4 = ratio, d_5 = ratio, d_6 = ratio, d_7 = ratio, d_8 = ratio, d_9 = ratio;
        tmp_count = 0;
        current_status = 'F';

        for(tmp_count = 0; tmp_count < ratio; tmp_count++){
          if(degree_distance[tmp_count] > 0){
            tmp_1 += degree_distance[tmp_count];
          }
          /* degree distance equal to 0 : invalid
           * we should ignore the invalid value when we calculate average value
           */
          else{
            d_1 --;
          }

          if(degree_distance[tmp_count + ratio] > 0){
            tmp_2 += degree_distance[tmp_count+ratio];
          }
          else{
            d_2 --;
          }

          if(degree_distance[tmp_count + ratio*2] > 0){
            tmp_3 += degree_distance[tmp_count + ratio*2];
          }
          else{
            d_3 --;
          }
          
          if(degree_distance[tmp_count + ratio*3] > 0){
            tmp_4 += degree_distance[tmp_count + ratio*3];
          }
          else{
            d_4 --;
          }
          
          if(degree_distance[tmp_count + ratio*4] > 0){
            tmp_5 += degree_distance[tmp_count + ratio*4];
          }
          else{
            d_5 --;
          }

          if(degree_distance[tmp_count + ratio*5] > 0){
            tmp_6 += degree_distance[tmp_count + ratio*5];
          }
          else{
            d_6 --;
          }

          if(degree_distance[tmp_count + ratio*6] > 0){
            tmp_7 += degree_distance[tmp_count + ratio*6];
          }
          else{
            d_7 --;
          }

          if(degree_distance[tmp_count + ratio*7] > 0){
            tmp_8 += degree_distance[tmp_count + ratio*7];
          }
          else{
            d_8 --;
          }

          if(degree_distance[tmp_count + ratio*8] > 0){
            tmp_9 += degree_distance[tmp_count + ratio*8];
          }
          else{
            d_9 --;
          }
        }

        /* Get the average distance from 9 direction */
        tmp_1 = tmp_1/d_1;
        tmp_2 = tmp_2/d_2;
        tmp_3 = tmp_3/d_3;
        tmp_4 = tmp_4/d_4;
        tmp_5 = tmp_5/d_5;
        tmp_6 = tmp_6/d_6;
        tmp_7 = tmp_7/d_7;
        tmp_8 = tmp_8/d_8;
        tmp_9 = tmp_9/d_9;

      /* There is a obstacle in front of the scooter. send 'A' */
      if((tmp_1 < 500)&(d_1)){
        current_status = 'A';
        sendAlarmDirection('G');
      }

      if((tmp_2 < 600)&(d_2)){
        current_status = 'A';
        sendAlarmDirection('H');
      }

      if((tmp_3 < 800)&(d_3)){
        current_status = 'A';
        sendAlarmDirection('I');
      }

      if((tmp_4 < 1500)&(d_4)){
        current_status = 'A';
        sendAlarmDirection('J');
      }

      if((tmp_5 < 3500)&(d_5)){
        current_status = 'A';
        sendAlarmDirection('K');
      }

      if((tmp_6 < 1500)&(d_6)){
        current_status = 'A';
        sendAlarmDirection('L');
      }

      if((tmp_7 < 800)&(d_7)){
        current_status = 'A';
        sendAlarmDirection('M');
      }

      if((tmp_8 < 600)&(d_8)){
        current_status = 'A';
        sendAlarmDirection('N');
      }

      if((tmp_9 < 500)&(d_9)){
        current_status = 'A';
        sendAlarmDirection('O');
      }

      if(btFlag == 0){
        while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
        USART_SendData(USARTy, current_status);
      }

      vTaskDelay(100);
  }
}

void sendAlarmDirection(char c){
  while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
  USART_SendData(USARTy, c);
}

static void external_interrupt_task(void *pvParameters){
  PWM1 = 0;
  
  while(1){
    v_tmp = ((1000*1000/diffTime)*(3600/1000)) / 1000;
    if (v_tmp >= 0 && v_tmp < 30)
    {
      put_int(v_tmp);
    }
    vTaskDelay(500);
  }
}

void put_int(uint32_t number){
  btFlag = 1;
  unsigned char char_buff[10] = {0};
  int count = 0;
  
  /* Trnasfer integer to chars */
  itoa(number, char_buff, 10);
  
  while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
    USART_SendData(USARTy, 'S');

  vTaskDelay(1);

  /* Send the char buffer to usart */
  while(count < 2){
    while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
    USART_SendData(USARTy, char_buff[count]);
    count ++;
  }

  vTaskDelay(1);
  while(USART_GetFlagStatus(USARTy, USART_FLAG_TXE) == RESET);
    USART_SendData(USARTy, 'E');

  vTaskDelay(1);
  btFlag = 0;
}

/**
  * @brief  Use this function to check index of receive data is in the range of correct index number.
  * @param  None
  * @retval None
  */
int check_index(unsigned int index){
  if(index >= 0xA0 && index < 0xFA){ 
    return 1;
  }
  else{ 
    return 0;
  }
}

/**
  * @brief  Use this function to check the packets are correct.
  * @param  None
  * @retval None
  */
int check_sum(){
  int count;
  int transfer;
  long check32 = 0;
  long checksum;
  long received_checksum;

  for (count = 0; count < 10; count++){
    transfer = current_packet[2 * count] + ((int)current_packet[2 * count + 1] << 8);
    check32 = (check32 << 1) + transfer;
  }

  checksum = (check32 & 0x7FFF) + (check32 >> 15);
  checksum = checksum & 0x7FFF;
  received_checksum = current_packet[20] + ((int)current_packet[21] << 8);
  
  if (checksum == received_checksum){
    return 1;
  }
  else{
    return 0;
  }
}

/**
  * @brief  This function write the correct data to lidarBuffer.
  * @param  None
  * @retval None
  */
void write_packet(){
  int count = 0;
  int index = current_packet[1] - 160/* index start from (A0)16 = (160)(10)*/;

  for(; count < 16; count++){
    lidarBuffer[index].data[count] = current_packet[count];
  }
  writed_packet_num ++;
  //PWM5 = (writed_packet_num/100);  // check for receive data
}

/**
  * @brief  This function reset the flags and counts, and reenable the Interrrupt of Usart.
  * @param  None
  * @retval None
  */
void reset_tmp(){
  /* enable USART interrupt */
  NVIC_EnableIRQ(USARTx_IRQn);
  
  current_received_byte = 0;
  started_flag = 0;
}

/**
  * @brief  This function convert the distance data from byte format.
  * @param  None
  * @retval None
  */
uint16_t distance_convert(uint8_t data0, uint8_t data1){
  uint16_t distance_data = ((0x00FF & data1) << 8) | data0;
  
  if ((distance_data & 0x8000) == 0x8000){
    //return 6000;/*if the data is invalid, return the maximum value.*/
    return -1;
  }
  else{
    return distance_data & 0x3FFF;
  }
}

/**
  * @brief  This function handles EXTI0_IRQ Handler.
  * @param  None
  * @retval None
  */
void EXTI0_IRQHandler(void)
{
  /* Clear the EXTI line pending bit */
  EXTI_ClearITPendingBit(USER_BUTTON_EXTI_LINE);
  if(UserButtonPressed){
    UserButtonPressed = 0x00;
  }else
    UserButtonPressed = 0x01;

